---
kind: method
id: M:Autodesk.Revit.DB.LinkElementId.#ctor(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
source: html/f8cebb9e-d6d5-28a3-5a53-8d3fe71346aa.htm
---
# Autodesk.Revit.DB.LinkElementId.#ctor Method

Creates a new LinkElementId representing an element in a linked document.

## Syntax (C#)
```csharp
public LinkElementId(
	ElementId linkInstanceId,
	ElementId elementId
)
```

## Parameters
- **linkInstanceId** (`Autodesk.Revit.DB.ElementId`) - The id of the linked model element in the host document.
- **elementId** (`Autodesk.Revit.DB.ElementId`) - The id of the element in the linked model document.